In [2]:
df = sns.load_dataset('titanic')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [3]:
df.drop_duplicates(inplace=True)

In [4]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            106
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           582
embark_town      2
alive            0
alone            0
dtype: int64

we decided to drop deck column because it has too many missing values

In [5]:
df.drop('deck', axis=1, inplace=True)
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

### ðŸ§¹ Removing Duplicated Columns

- **`embarked` and `embark_town` are duplicated columns**
  Both represent the port of embarkation. Since `embark_town` contains more complete data, **`embarked` is dropped**.

- **`pclass` and `class` are duplicated columns**
  Both describe the passenger class. The `pclass` column is more convenient for analysis and modeling because it is numeric. Therefore, **`class` is dropped**.

- **`alive` is a duplicate of the `survived` column**
  Since both columns contain the same information, **`alive` is dropped** to avoid redundancy.

In [6]:
df.drop(['embarked', 'class', 'alive'], axis=1, inplace=True)
df

,survived,pclass,sex,age,sibsp,parch,fare,who,adult_male,embark_town,alone
0,0,3,male,22.0,1,0,7.2500,man,True,Southampton,False
1,1,1,female,38.0,1,0,71.2833,woman,False,Cherbourg,False
2,1,3,female,26.0,0,0,7.9250,woman,False,Southampton,True
3,1,1,female,35.0,1,0,53.1000,woman,False,Southampton,False
4,0,3,male,35.0,0,0,8.0500,man,True,Southampton,True
...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,woman,False,Queenstown,False
887,1,1,female,19.0,0,0,30.0000,woman,False,Southampton,True
888,0,3,female,NaN,1,2,23.4500,woman,False,Southampton,False
889,1,1,male,26.0,0,0,30.0000,man,True,Cherbourg,True
890,0,3,male,32.0,0,0,7.7500,man,True,Queenstown,True

In [7]:
df['embark_town'].fillna(df['embark_town'].mode()[0], inplace=True)

In [8]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            106
sibsp            0
parch            0
fare             0
who              0
adult_male       0
embark_town      0
alone            0
dtype: int64

In [9]:
df = df[
    [
        'survived',
        'sex', 'age', 'who', 'adult_male',
        'pclass', 'fare', 'embark_town',
        'sibsp', 'parch', 'alone'
    ]
]
df

,survived,sex,age,who,adult_male,pclass,fare,embark_town,sibsp,parch,alone
0,0,male,22.0,man,True,3,7.2500,Southampton,1,0,False
1,1,female,38.0,woman,False,1,71.2833,Cherbourg,1,0,False
2,1,female,26.0,woman,False,3,7.9250,Southampton,0,0,True
3,1,female,35.0,woman,False,1,53.1000,Southampton,1,0,False
4,0,male,35.0,man,True,3,8.0500,Southampton,0,0,True
...,...,...,...,...,...,...,...,...,...,...,...
885,0,female,39.0,woman,False,3,29.1250,Queenstown,0,5,False
887,1,female,19.0,woman,False,1,30.0000,Southampton,0,0,True
888,0,female,NaN,woman,False,3,23.4500,Southampton,1,2,False
889,1,male,26.0,man,True,1,30.0000,Cherbourg,0,0,True
890,0,male,32.0,man,True,3,7.7500,Queenstown,0,0,True

In [10]:
df['age'] = df.groupby('who')['age'].ffill()

In [11]:
df

,survived,sex,age,who,adult_male,pclass,fare,embark_town,sibsp,parch,alone
0,0,male,22.0,man,True,3,7.2500,Southampton,1,0,False
1,1,female,38.0,woman,False,1,71.2833,Cherbourg,1,0,False
2,1,female,26.0,woman,False,3,7.9250,Southampton,0,0,True
3,1,female,35.0,woman,False,1,53.1000,Southampton,1,0,False
4,0,male,35.0,man,True,3,8.0500,Southampton,0,0,True
...,...,...,...,...,...,...,...,...,...,...,...
885,0,female,39.0,woman,False,3,29.1250,Queenstown,0,5,False
887,1,female,19.0,woman,False,1,30.0000,Southampton,0,0,True
888,0,female,19.0,woman,False,3,23.4500,Southampton,1,2,False
889,1,male,26.0,man,True,1,30.0000,Cherbourg,0,0,True
890,0,male,32.0,man,True,3,7.7500,Queenstown,0,0,True